#include "UTFTMenu.h"

//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// подключаем наши экраны
#include "Screen1.h"
#include "Screen2.h"
#include "Screen3.h"

// подключаем часики
#include "DS3231.h"
#include <XBee.h>
#include "XBeeMenu.h"
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------



void setup() 
{
  // настраиваем часики
  RealtimeClock.begin(1); // запускаем их на шине I2C 1 (SDA1, SCL1);

  Serial1.begin(9600);                                               // Подключение к
  //xbee.setSerial(Serial1);
  
  Screen.setup();
  // первый экран покажется по умолчанию
  Screen.addScreen(Screen1::create());

  // добавляем второй экран
  Screen.addScreen(Screen2::create());

  // добавляем третий экран
  Screen.addScreen(Screen3::create());
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void loop() 
{
  Screen.update();
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------

