//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#include "Screen1_1.h"
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Screen1_1::Screen1_1() : AbstractTFTScreen("SCREEN1_1")
{
  
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Screen1_1::doSetup(TFTMenu* menu)
{
  // тут настраиваемся, например, можем добавлять кнопки
	screenButtons->addButton(10, 20, 220, 40, "Подключить ИУ");
	screenButtons->addButton(10 ,70, 220, 40, "Сменить USER");
	screenButtons->addButton(10, 120, 220, 40, "Меню файлов");
	screenButtons->addButton(10, 170, 220, 40, "Настр. сист.");
	screenButtons->addButton(10, 220, 220, 40, "ВОЗВРАТ");
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Screen1_1::doUpdate(TFTMenu* menu)
{
    // тут обновляем внутреннее состояние
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Screen1_1::doDraw(TFTMenu* menu)
{
  UTFT* dc = menu->getDC();
  dc->setColor(VGA_WHITE);
  dc->setBackColor(VGA_BLACK);
  dc->setFont(TFT_FONT);
  
  // тут рисуем, что надо именно нам, кнопки прорисуются сами после того, как мы тут всё отрисуем
  menu->print("Подключить ИУ", 15, 0);
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Screen1_1::onButtonPressed(TFTMenu* menu, int pressedButton)
{
  // обработчик нажатия на кнопку. Номера кнопок начинаются с 0 и идут в том порядке, в котором мы их добавляли
  if(pressedButton == 0)
    menu->switchToScreen("SCREEN1"); // переключаемся на первый экран
	else if(pressedButton == 1)
	menu->switchToScreen("SCREEN1_2"); // переключаемся на третий экран
	else if (pressedButton == 2)
		menu->switchToScreen("SCREEN1_3"); // переключаемся на третий экран
	else if (pressedButton == 3)
		menu->switchToScreen("SCREEN1_4"); // переключаемся на третий экран
	else if (pressedButton == 4)
		menu->switchToScreen("SCREEN1"); // переключаемся на третий экран
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------

