//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#include "Screen2_2.h"
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Screen2_2::Screen2_2() : AbstractTFTScreen("SCREEN2_2")
{
  
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Screen2_2::doSetup(TFTMenu* menu)
{
  // тут настраиваемся, например, можем добавлять кнопки
  screenButtons->addButton( 10 ,  30, 200,  50, "ВОЗВРАТ");
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Screen2_2::doUpdate(TFTMenu* menu)
{
    // тут обновляем внутреннее состояние
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Screen2_2::doDraw(TFTMenu* menu)
{
  UTFT* dc = menu->getDC();
  dc->setColor(VGA_WHITE);
  dc->setBackColor(VGA_BLACK);
  dc->setFont(TFT_FONT);
  
  // тут рисуем, что надо именно нам, кнопки прорисуются сами после того, как мы тут всё отрисуем
  menu->print("Сменить USER", 20, 0);
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Screen2_2::onButtonPressed(TFTMenu* menu, int pressedButton)
{
  // обработчик нажатия на кнопку. Номера кнопок начинаются с 0 и идут в том порядке, в котором мы их добавляли
  if(pressedButton == 0)
    menu->switchToScreen("SCREEN1_1"); // переключаемся на первый экран
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------

