//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#include "Screen1.h"
#include "DS3231.h"
#include "CONFIG.h"


//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Screen1* mainScreen = NULL;        
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------

//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Screen1::Screen1() : AbstractTFTScreen("Main")
{
  oldsecond = 0;
  mainScreen = this;
 
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------

//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Screen1::onDeactivate()
{
  // станем неактивными, надо выключить подписчика результатов прерываний
 
  
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Screen1::onActivate()
{
 
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Screen1::doSetup(TFTMenu* menu)
{
	DBGLN(F("doSetup."));
	screenButtons->setSymbolFont(Various_Symbols_32x32);
	// тут настраиваемся, например, можем добавлять кнопки
	screenButtons->addButton(5, 275, 190, 40, "НАСТРОЙКИ");
	screenButtons->addButton(200, 275, 35, 40, "z", BUTTON_SYMBOL); // кнопка Часы 

}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Screen1::drawTime(TFTMenu* menu)
{

    DS3231Time tm = RealtimeClock.getTime();
    if (oldsecond != tm.second)
    {
        oldsecond = tm.second;
      // получаем компоненты даты в виде строк
      UTFT* dc = menu->getDC();
      dc->setColor(VGA_WHITE);
      dc->setBackColor(VGA_BLACK);
      dc->setFont(SmallRusFont);
      String strDate = RealtimeClock.getDateStr(tm);
      String strTime = RealtimeClock.getTimeStr(tm);
  
      // печатаем их
      dc->print(strDate, 5, 1);
      dc->print(strTime, 90, 1);
        
    }
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Screen1::doUpdate(TFTMenu* menu)
{
	DBGLN(F("doUpdate."));
  drawTime(menu);

	// тут обновляем внутреннее состояние
}

//------------------------------------------------------------------------------------------------------------------------------------------------------------------------

//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Screen1::doDraw(TFTMenu* menu)
{
	DBGLN(F("doDraw."));
  drawTime(menu);

  // рисуем версию ПО
  UTFT* dc = menu->getDC();
  dc->setColor(VGA_WHITE);
  dc->setBackColor(VGA_BLACK);
  dc->setFont(SmallRusFont);

  uint16_t w = dc->getDisplayXSize();
  uint8_t fw = dc->getFontXsize();
  String str = SOFTWARE_VERSION;

  int strL = menu->print(str.c_str(),0,0,0,true);
  int strW = strL*fw;

  int top = 1;
  int left = w - strW - 3;

  menu->print(str.c_str(),left,top);
    
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Screen1::onButtonPressed(TFTMenu* menu, int pressedButton)
{
  // обработчик нажатия на кнопку. Номера кнопок начинаются с 0 и идут в том порядке, в котором мы их добавляли
	if (pressedButton == 0)
	{
		menu->switchToScreen("Settings"); // переключаемся на экран работы с SD
    }
	else if (pressedButton == 1)
	{
		menu->switchToScreen("SCREEN4"); // переключаемся на третий экран
	}
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------

//------------------------------------------------------------------------------------------------------------------------------------------------------------------------

